//线性表：顺序表/链表/栈/队列/串/数组/矩阵/广义表
//顺序表：数组(连续空间)
//链表：结点 + 指针
//栈：顺序栈/链栈
//顺序栈：1.后进先出 2.top栈顶指针/base栈底指针 3.top - base = MAXSIZE栈满 4.base不动,只动top
//链栈：1.后进先出 2.base指针指向尾结点 3.为没有头结点的链表 4.无栈满情况
//循环顺序队列：1.先进先出 2.top指针指向头/rear指针指向尾 3.入队动rear/出队动top 4.队空：top = rear 5.队满：(rear+1)%MAXQSIZE = top
//链队列：1.先进先出 2.top指针指向头结点/rear指针指向尾结点 3.相当于只进行头尾操作的链表
//顺序串：1.字符数组 2.串尾有'\0'
//链串(很少)
//串的模式匹配算法：1.BF算法：暴力破解算法 2.KMP算法：next数组/nextval数组(递归法)
//数组：1.n维数组在内存里为一维存储 2.可以用地址找到所有元素
//矩阵：1.二维数组 2.对称矩阵/三角矩阵/带状矩阵/稀疏矩阵的压缩存储
//广义表：1.递归结构 2.头尾链表存储结构/扩展线性表存储结构
//树：1.非线性结构 2.二叉树/满二叉树/完全二叉树 3.遍历二叉树算法...
